RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6700/ip/hpm_jpeg_regs.h
/*
 * OP_VALID (RW)
 *
 * asserted if there is either a DATA DMA phase or NXTCMD phase. Automatically cleared. Will trigger the OutDMA and NXTCMD phase transfer if CFG[JPEG_EN] is 1.
 */
#define JPEG_ONXT_CMD_OP_VALID_MASK (0x2U)
#define JPEG_ONXT_CMD_OP_VALID_SHIFT (1U)
#define JPEG_ONXT_CMD_OP_VALID_SET(x) (((uint32_t)(x) << JPEG_ONXT_CMD_OP_VALID_SHIFT) & JPEG_ONXT_CMD_OP_VALID_MASK)
#define JPEG_ONXT_CMD_OP_VALID_GET(x) (((uint32_t)(x) & JPEG_ONXT_CMD_OP_VALID_MASK) >> JPEG_ONXT_CMD_OP_VALID_SHIFT)

/*
 * EN (RW)
 *
 * NXTCMD phase Enable Bit
 */
#define JPEG_ONXT_CMD_EN_MASK (0x1U)
#define JPEG_ONXT_CMD_EN_SHIFT (0U)
#define JPEG_ONXT_CMD_EN_SET(x) (((uint32_t)(x) << JPEG_ONXT_CMD_EN_SHIFT) & JPEG_ONXT_CMD_EN_MASK)
#define JPEG_ONXT_CMD_EN_GET(x) (((uint32_t)(x) & JPEG_ONXT_CMD_EN_MASK) >> JPEG_ONXT_CMD_EN_SHIFT)

/* Bitfield definition for register: CFG */
/*
 * JD_UVSWAP (RW)
 *
 * Normally the default CbCr sequence is that Cb macro block coming before Cr macro blk. If Cr macro block is first, set this bit to 1'b1. This bit only impact the color space conversion from/to RGB.
 */
#define JPEG_CFG_JD_UVSWAP_MASK (0x400000UL)
#define JPEG_CFG_JD_UVSWAP_SHIFT (22U)
#define JPEG_CFG_JD_UVSWAP_SET(x) (((uint32_t)(x) << JPEG_CFG_JD_UVSWAP_SHIFT) & JPEG_CFG_JD_UVSWAP_MASK)
#define JPEG_CFG_JD_UVSWAP_GET(x) (((uint32_t)(x) & JPEG_CFG_JD_UVSWAP_MASK) >> JPEG_CFG_JD_UVSWAP_SHIFT)

/*
 * CFG_IPATH_SEL (RW)
 *
 * 2'b0:2-plane (Y- and UV- plane) or 1-plane (Y-only) as determined by the original data, byte sequence as Y0,Y1, or U,V
 * 2'b01:ARGB8888, byte sequence as B,G,R,A
 * 2'b10:RGB565, byte sequence as B,R
 * 2'b11: YUV422H, byte sequence as Y0,U0,Y1,V0
 */
#define JPEG_CFG_CFG_IPATH_SEL_MASK (0x300000UL)
#define JPEG_CFG_CFG_IPATH_SEL_SHIFT (20U)
#define JPEG_CFG_CFG_IPATH_SEL_SET(x) (((uint32_t)(x) << JPEG_CFG_CFG_IPATH_SEL_SHIFT) & JPEG_CFG_CFG_IPATH_SEL_MASK)
#define JPEG_CFG_CFG_IPATH_SEL_GET(x) (((uint32_t)(x) & JPEG_CFG_CFG_IPATH_SEL_MASK) >> JPEG_CFG_CFG_IPATH_SEL_SHIFT)

/*
 * CODEC_OVER_IRQ_EN (RW)
 *
 * The jpg endec process done interrupt enable
 */
#define JPEG_CFG_CODEC_OVER_IRQ_EN_MASK (0x80000UL)
#define JPEG_CFG_CODEC_OVER_IRQ_EN_SHIFT (19U)
#define JPEG_CFG_CODEC_OVER_IRQ_EN_SET(x) (((uint32_t)(x) << JPEG_CFG_CODEC_OVER_IRQ_EN_SHIFT) & JPEG_CFG_CODEC_OVER_IRQ_EN_MASK)
#define JPEG_CFG_CODEC_OVER_IRQ_EN_GET(x) (((uint32_t)(x) & JPEG_CFG_CODEC_OVER_IRQ_EN_MASK) >> JPEG_CFG_CODEC_OVER_IRQ_EN_SHIFT)

/*
 * CODEC_RESTART_ERR_IRQ_EN (RW)
 *
 * The jpg endec restart error interrupt enable
 */
#define JPEG_CFG_CODEC_RESTART_ERR_IRQ_EN_MASK (0x40000UL)
#define JPEG_CFG_CODEC_RESTART_ERR_IRQ_EN_SHIFT (18U)
#define JPEG_CFG_CODEC_RESTART_ERR_IRQ_EN_SET(x) (((uint32_t)(x) << JPEG_CFG_CODEC_RESTART_ERR_IRQ_EN_SHIFT) & JPEG_CFG_CODEC_RESTART_ERR_IRQ_EN_MASK)
#define JPEG_CFG_CODEC_RESTART_ERR_IRQ_EN_GET(x) (((uint32_t)(x) & JPEG_CFG_CODEC_RESTART_ERR_IRQ_EN_MASK) >> JPEG_CFG_CODEC_RESTART_ERR_IRQ_EN_SHIFT)

/*
 * MEM_DEBUG_CLK_SEL (RW)
 *
 * asserted to use APB clock, so that the memory contents could be read out through APB interface
 */
#define JPEG_CFG_MEM_DEBUG_CLK_SEL_MASK (0x20000UL)
#define JPEG_CFG_MEM_DEBUG_CLK_SEL_SHIFT (17U)
#define JPEG_CFG_MEM_DEBUG_CLK_SEL_SET(x) (((uint32_t)(x) << JPEG_CFG_MEM_DEBUG_CLK_SEL_SHIFT) & JPEG_CFG_MEM_DEBUG_CLK_SEL_MASK)
#define JPEG_CFG_MEM_DEBUG_CLK_SEL_GET(x) (((uint32_t)(x) & JPEG_CFG_MEM_DEBUG_CLK_SEL_MASK) >> JPEG_CFG_MEM_DEBUG_CLK_SEL_SHIFT)

/*
 * CLKGATE (RW)
 *
 * Assert this bit to gate off clock when the module is not working. If reset to zero, the internal clock is always on.
 */
#define JPEG_CFG_CLKGATE_MASK (0x200U)
#define JPEG_CFG_CLKGATE_SHIFT (9U)
#define JPEG_CFG_CLKGATE_SET(x) (((uint32_t)(x) << JPEG_CFG_CLKGATE_SHIFT) & JPEG_CFG_CLKGATE_MASK)
#define JPEG_CFG_CLKGATE_GET(x) (((uint32_t)(x) & JPEG_CFG_CLKGATE_MASK) >> JPEG_CFG_CLKGATE_SHIFT)

/*
 * CFG_OPATH_SEL (RW)
 *
 * 2'b0:2-plane (Y- and UV- plane) or 1-plane (Y-only) as determined by the original data, byte sequence as Y0,Y1, or U,V
 * 2'b01:ARGB8888, byte sequence as B,G,R,A
 * 2'b10:RGB565, byte sequence as R,B
 * 2'b11: YUV422H1P, byte sequence as Y0,U0,Y1,V0
 */
#define JPEG_CFG_CFG_OPATH_SEL_MASK (0x180U)
#define JPEG_CFG_CFG_OPATH_SEL_SHIFT (7U)
#define JPEG_CFG_CFG_OPATH_SEL_SET(x) (((uint32_t)(x) << JPEG_CFG_CFG_OPATH_SEL_SHIFT) & JPEG_CFG_CFG_OPATH_SEL_MASK)
#define JPEG_CFG_CFG_OPATH_SEL_GET(x) (((uint32_t)(x) & JPEG_CFG_CFG_OPATH_SEL_MASK) >> JPEG_CFG_CFG_OPATH_SEL_SHIFT)

/*
 * JDATA_FORMAT (RW)
 *
 * 3'b000: for 420,  hy=2, vy=2, hc=1, vc=1 // 6 sub-blocks per MCU
 * 3'b001: for 422h, hy=2, vy=1, hc=1, vc=1 // 4 sub-blocks per MCU
 * 3'b010: for 422v, hy=1, vy=2, hc=1, vc=1 // 4 sub-blocks per MCU
 * 3'b011: for 444,  hy=1, vy=1, hc=1, vc=1 // 3 sub-blocks per MCU
 * 3'b100: for 400,  hy=2, vy=2, hc=0, vc=0 // 4 sub-blocks  per MCU
 * Others: Undefined
 */
#define JPEG_CFG_JDATA_FORMAT_MASK (0x70U)
#define JPEG_CFG_JDATA_FORMAT_SHIFT (4U)
#define JPEG_CFG_JDATA_FORMAT_SET(x) (((uint32_t)(x) << JPEG_CFG_JDATA_FORMAT_SHIFT) & JPEG_CFG_JDATA_FORMAT_MASK)
#define JPEG_CFG_JDATA_FORMAT_GET(x) (((uint32_t)(x) & JPEG_CFG_JDATA_FORMAT_MASK) >> JPEG_CFG_JDATA_FORMAT_SHIFT)

/*
 * JPEG_SFTRST (RW)
 *
 * Software Reset
 */
#define JPEG_CFG_JPEG_SFTRST_MASK (0x8U)
#define JPEG_CFG_JPEG_SFTRST_SHIFT (3U)
#define JPEG_CFG_JPEG_SFTRST_SET(x) (((uint32_t)(x) << JPEG_CFG_JPEG_SFTRST_SHIFT) & JPEG_CFG_JPEG_SFTRST_MASK)
#define JPEG_CFG_JPEG_SFTRST_GET(x) (((uint32_t)(x) & JPEG_CFG_JPEG_SFTRST_MASK) >> JPEG_CFG_JPEG_SFTRST_SHIFT)

/*
 * START (RW)
 *
 * Asserted if to start a new encoder/decoder conversion.
 * It will at first stop the inner JPEG module, then reset it, and then re-run it.
 * It is a different mode from DMA phase mode.
 * It cannot be configured in the DMA chain descriptor. It should be configured by the core processor.
 * Auto clear.
 */
#define JPEG_CFG_START_MASK (0x4U)
#define JPEG_CFG_START_SHIFT (2U)
#define JPEG_CFG_START_SET(x) (((uint32_t)(x) << JPEG_CFG_START_SHIFT) & JPEG_CFG_START_MASK)
#define JPEG_CFG_START_GET(x) (((uint32_t)(x) & JPEG_CFG_START_MASK) >> JPEG_CFG_START_SHIFT)

