RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6700/ip/hpm_jpeg_regs.h
/*
 * MODE (RW)
 *
 * 1: decoder, 0:encoder
 */
#define JPEG_CFG_MODE_MASK (0x2U)
#define JPEG_CFG_MODE_SHIFT (1U)
#define JPEG_CFG_MODE_SET(x) (((uint32_t)(x) << JPEG_CFG_MODE_SHIFT) & JPEG_CFG_MODE_MASK)
#define JPEG_CFG_MODE_GET(x) (((uint32_t)(x) & JPEG_CFG_MODE_MASK) >> JPEG_CFG_MODE_SHIFT)

/*
 * JPEG_EN (RW)
 *
 * 1b - Enabled
 */
#define JPEG_CFG_JPEG_EN_MASK (0x1U)
#define JPEG_CFG_JPEG_EN_SHIFT (0U)
#define JPEG_CFG_JPEG_EN_SET(x) (((uint32_t)(x) << JPEG_CFG_JPEG_EN_SHIFT) & JPEG_CFG_JPEG_EN_MASK)
#define JPEG_CFG_JPEG_EN_GET(x) (((uint32_t)(x) & JPEG_CFG_JPEG_EN_MASK) >> JPEG_CFG_JPEG_EN_SHIFT)

/* Bitfield definition for register: STAT */
/*
 * BUSY (RO)
 *
 * When 1 means that the module is busy doing conversion and data transfer.
 */
#define JPEG_STAT_BUSY_MASK (0x80000000UL)
#define JPEG_STAT_BUSY_SHIFT (31U)
#define JPEG_STAT_BUSY_GET(x) (((uint32_t)(x) & JPEG_STAT_BUSY_MASK) >> JPEG_STAT_BUSY_SHIFT)

/*
 * AXI_ERR_ID (RO)
 *
 * the axi err id
 */
#define JPEG_STAT_AXI_ERR_ID_MASK (0x3C00U)
#define JPEG_STAT_AXI_ERR_ID_SHIFT (10U)
#define JPEG_STAT_AXI_ERR_ID_GET(x) (((uint32_t)(x) & JPEG_STAT_AXI_ERR_ID_MASK) >> JPEG_STAT_AXI_ERR_ID_SHIFT)

/*
 * AXI_READ_ERR (RO)
 *
 * in-dma axi bus error
 */
#define JPEG_STAT_AXI_READ_ERR_MASK (0x200U)
#define JPEG_STAT_AXI_READ_ERR_SHIFT (9U)
#define JPEG_STAT_AXI_READ_ERR_GET(x) (((uint32_t)(x) & JPEG_STAT_AXI_READ_ERR_MASK) >> JPEG_STAT_AXI_READ_ERR_SHIFT)

/*
 * AXI_WRITE_ERR (RO)
 *
 * out-dma axi bus error
 */
#define JPEG_STAT_AXI_WRITE_ERR_MASK (0x100U)
#define JPEG_STAT_AXI_WRITE_ERR_SHIFT (8U)
#define JPEG_STAT_AXI_WRITE_ERR_GET(x) (((uint32_t)(x) & JPEG_STAT_AXI_WRITE_ERR_MASK) >> JPEG_STAT_AXI_WRITE_ERR_SHIFT)

/*
 * AXI_ERR (W1C)
 *
 * axi bus error
 */
#define JPEG_STAT_AXI_ERR_MASK (0x80U)
#define JPEG_STAT_AXI_ERR_SHIFT (7U)
#define JPEG_STAT_AXI_ERR_SET(x) (((uint32_t)(x) << JPEG_STAT_AXI_ERR_SHIFT) & JPEG_STAT_AXI_ERR_MASK)
#define JPEG_STAT_AXI_ERR_GET(x) (((uint32_t)(x) & JPEG_STAT_AXI_ERR_MASK) >> JPEG_STAT_AXI_ERR_SHIFT)

/*
 * ONXT_IRQ (W1C)
 *
 * OutDMA next interrupt
 */
#define JPEG_STAT_ONXT_IRQ_MASK (0x40U)
#define JPEG_STAT_ONXT_IRQ_SHIFT (6U)
#define JPEG_STAT_ONXT_IRQ_SET(x) (((uint32_t)(x) << JPEG_STAT_ONXT_IRQ_SHIFT) & JPEG_STAT_ONXT_IRQ_MASK)
#define JPEG_STAT_ONXT_IRQ_GET(x) (((uint32_t)(x) & JPEG_STAT_ONXT_IRQ_MASK) >> JPEG_STAT_ONXT_IRQ_SHIFT)

/*
 * INXT_IRQ (W1C)
 *
 * InDMA next interrupt
 */
#define JPEG_STAT_INXT_IRQ_MASK (0x20U)
#define JPEG_STAT_INXT_IRQ_SHIFT (5U)
#define JPEG_STAT_INXT_IRQ_SET(x) (((uint32_t)(x) << JPEG_STAT_INXT_IRQ_SHIFT) & JPEG_STAT_INXT_IRQ_MASK)
#define JPEG_STAT_INXT_IRQ_GET(x) (((uint32_t)(x) & JPEG_STAT_INXT_IRQ_MASK) >> JPEG_STAT_INXT_IRQ_SHIFT)

/*
 * OUT_DMA_TRANSFER_DONE (W1C)
 *
 * OutDMA process done
 */
#define JPEG_STAT_OUT_DMA_TRANSFER_DONE_MASK (0x10U)
#define JPEG_STAT_OUT_DMA_TRANSFER_DONE_SHIFT (4U)
#define JPEG_STAT_OUT_DMA_TRANSFER_DONE_SET(x) (((uint32_t)(x) << JPEG_STAT_OUT_DMA_TRANSFER_DONE_SHIFT) & JPEG_STAT_OUT_DMA_TRANSFER_DONE_MASK)
#define JPEG_STAT_OUT_DMA_TRANSFER_DONE_GET(x) (((uint32_t)(x) & JPEG_STAT_OUT_DMA_TRANSFER_DONE_MASK) >> JPEG_STAT_OUT_DMA_TRANSFER_DONE_SHIFT)

/*
 * IN_DMA_TRANSFER_DONE (W1C)
 *
 * InDMA process done
 */
#define JPEG_STAT_IN_DMA_TRANSFER_DONE_MASK (0x8U)
#define JPEG_STAT_IN_DMA_TRANSFER_DONE_SHIFT (3U)
#define JPEG_STAT_IN_DMA_TRANSFER_DONE_SET(x) (((uint32_t)(x) << JPEG_STAT_IN_DMA_TRANSFER_DONE_SHIFT) & JPEG_STAT_IN_DMA_TRANSFER_DONE_MASK)
#define JPEG_STAT_IN_DMA_TRANSFER_DONE_GET(x) (((uint32_t)(x) & JPEG_STAT_IN_DMA_TRANSFER_DONE_MASK) >> JPEG_STAT_IN_DMA_TRANSFER_DONE_SHIFT)

/*
 * CODEC_OVER (W1C)
 *
 * Coding or decoding process is over. DMA is not included.
 * The module is completely not busy only when in_dma_transfer_done and out_dma_transfer_done, and codec_over are all asserted.
 */
#define JPEG_STAT_CODEC_OVER_MASK (0x4U)
#define JPEG_STAT_CODEC_OVER_SHIFT (2U)
#define JPEG_STAT_CODEC_OVER_SET(x) (((uint32_t)(x) << JPEG_STAT_CODEC_OVER_SHIFT) & JPEG_STAT_CODEC_OVER_MASK)
#define JPEG_STAT_CODEC_OVER_GET(x) (((uint32_t)(x) & JPEG_STAT_CODEC_OVER_MASK) >> JPEG_STAT_CODEC_OVER_SHIFT)

/*
 * RESTART_MARKER_ERROR (W1C)
 *
 * codec restart marker error interrupt
 */
#define JPEG_STAT_RESTART_MARKER_ERROR_MASK (0x2U)
#define JPEG_STAT_RESTART_MARKER_ERROR_SHIFT (1U)
#define JPEG_STAT_RESTART_MARKER_ERROR_SET(x) (((uint32_t)(x) << JPEG_STAT_RESTART_MARKER_ERROR_SHIFT) & JPEG_STAT_RESTART_MARKER_ERROR_MASK)
#define JPEG_STAT_RESTART_MARKER_ERROR_GET(x) (((uint32_t)(x) & JPEG_STAT_RESTART_MARKER_ERROR_MASK) >> JPEG_STAT_RESTART_MARKER_ERROR_SHIFT)

/* Bitfield definition for register: WIDTH */
/*
 * IMG (RW)
 *
 * Image Width (it is the max index of pixel counting from 0, assuming the top left pixel is indexed as [0,0])
 */
#define JPEG_WIDTH_IMG_MASK (0xFFFFU)
#define JPEG_WIDTH_IMG_SHIFT (0U)
#define JPEG_WIDTH_IMG_SET(x) (((uint32_t)(x) << JPEG_WIDTH_IMG_SHIFT) & JPEG_WIDTH_IMG_MASK)
#define JPEG_WIDTH_IMG_GET(x) (((uint32_t)(x) & JPEG_WIDTH_IMG_MASK) >> JPEG_WIDTH_IMG_SHIFT)

/* Bitfield definition for register: HEIGHT */
/*
 * IMG (RW)
 *
 * Image Height  (it is the max index of pixel counting from 0, assuming the top left pixel is indexed as [0,0])
 */
#define JPEG_HEIGHT_IMG_MASK (0xFFFFU)
#define JPEG_HEIGHT_IMG_SHIFT (0U)
#define JPEG_HEIGHT_IMG_SET(x) (((uint32_t)(x) << JPEG_HEIGHT_IMG_SHIFT) & JPEG_HEIGHT_IMG_MASK)
#define JPEG_HEIGHT_IMG_GET(x) (((uint32_t)(x) & JPEG_HEIGHT_IMG_MASK) >> JPEG_HEIGHT_IMG_SHIFT)

/* Bitfield definition for register: BUFADDR */
/*
 * ADDR (RW)
 *
 * ADDR[31:28] denotes the buffer type:
 * 0x2: Qmem
 * 0x3: HuffEnc
 * 0x4: HuffMin
 * 0x5: HuffBase
 * 0x6: HuffSymb
 * ADDR[27:0] is the address inside the buffer
 */
#define JPEG_BUFADDR_ADDR_MASK (0xFFFFFFFFUL)
#define JPEG_BUFADDR_ADDR_SHIFT (0U)
#define JPEG_BUFADDR_ADDR_SET(x) (((uint32_t)(x) << JPEG_BUFADDR_ADDR_SHIFT) & JPEG_BUFADDR_ADDR_MASK)
#define JPEG_BUFADDR_ADDR_GET(x) (((uint32_t)(x) & JPEG_BUFADDR_ADDR_MASK) >> JPEG_BUFADDR_ADDR_SHIFT)

/* Bitfield definition for register: BUFDATA */
/*
 * DATA (RW)
 *
 * The data write-to/read-from buffer.
 * The n-th address read will be actually the data written for n-1 th address, and the actual stored location is n-1 th address.
 */
#define JPEG_BUFDATA_DATA_MASK (0xFFFFFFFFUL)
#define JPEG_BUFDATA_DATA_SHIFT (0U)
#define JPEG_BUFDATA_DATA_SET(x) (((uint32_t)(x) << JPEG_BUFDATA_DATA_SHIFT) & JPEG_BUFDATA_DATA_MASK)
#define JPEG_BUFDATA_DATA_GET(x) (((uint32_t)(x) & JPEG_BUFDATA_DATA_MASK) >> JPEG_BUFDATA_DATA_SHIFT)

